---
kind: method
id: M:Autodesk.Revit.DB.ExportFontKey.Dispose
source: html/7324548e-6edd-884c-0195-7120b3ead31a.htm
---
# Autodesk.Revit.DB.ExportFontKey.Dispose Method

Releases all resources used by the ExportFontKey

## Syntax (C#)
```csharp
public void Dispose()
```